In [1]:
# https://dplyr.tidyverse.org/reference/mutate-joins.html
from datar.datasets import band_members, band_instruments, band_instruments2
from datar.all import *

In [2]:
band_members >> inner_join(band_instruments)

   name     band   plays
0  John  Beatles  guitar
1  Paul  Beatles    bass

In [3]:
band_members >> left_join(band_instruments)

   name     band   plays
0  Mick   Stones     NaN
1  John  Beatles  guitar
2  Paul  Beatles    bass

In [4]:
band_members >> right_join(band_instruments)

    name     band   plays
0   John  Beatles  guitar
1   Paul  Beatles    bass
2  Keith      NaN  guitar

In [5]:
band_members >> full_join(band_instruments)

    name     band   plays
0   Mick   Stones     NaN
1   John  Beatles  guitar
2   Paul  Beatles    bass
3  Keith      NaN  guitar

In [6]:
band_members >> inner_join(band_instruments, by=f.name)

  key_0 name_x     band name_y   plays
0  Mick   Mick   Stones   John  guitar
1  John   John  Beatles   Paul    bass
2  Paul   Paul  Beatles  Keith  guitar

In [7]:
band_members >> full_join(band_instruments2, by={'name': 'artist'})

   name     band   plays
0  Mick   Stones     NaN
1  John  Beatles  guitar
2  Paul  Beatles    bass
3   NaN      NaN  guitar

In [8]:
band_members >> full_join(band_instruments2, by={'name': 'artist'}, keep=True)

   name     band artist   plays
0  Mick   Stones    NaN     NaN
1  John  Beatles   John  guitar
2  Paul  Beatles   Paul    bass
3   NaN      NaN  Keith  guitar

In [9]:
df1 = tibble(x=[1,2,3])
df2 = tibble(x=[1,1,2], y=["first", "second", "third"])
df1 >> left_join(df2)

   x       y
0  1   first
1  1  second
2  2   third
3  3     NaN

In [10]:
df1 = tibble(x=[1, NA], y=2)
df2 = tibble(x=[1, NA], z=3)
left_join(df1, df2) # na_matches not supported yet

     x  y  z
0  1.0  2  3
1  NaN  2  3